<?php
/* @var $this yii\web\View */

$this->title = '欢迎进入BOSS业务运营支撑系统';
?>
<div class="site-index">

    <div class="body-content">
        <h1>新工作方式即将开始……</h1>
        <br><br>
        <h4>Boss 系统设计目标如下：</h4>

        <h4>准确性： 财务数据，要准确，错误率0%，所有数据涉及到钱的要求精确到0.00 </h4>
        <h4>安全性： 密码哈希，SQL注入，CSRF，Session， API， 交易多重验证，多方校验，状态平衡等问题</h4>
        <h4>高效性： 2年的数据，各个表的数据，查询，插入，等操作的响应时间，不能因为数据量大，而操作缓慢，任何操作，响应时间控制在5s以内 </h4>
        <h4>稳定性： 核心系统需要做稳定设计，不能因为一个机器宕机，就全盘宕机 </h4>
        <h4>维护性： 代码结构，需要清晰，API代码实现和稳定一致 </h4>
        <h4>文档全： 无论是产品文档还是技术文档，要求保存到系统当中doc.1jiajie.com </h4>
        <h4>易用性： 就一个要求，不要让使用者思考！ </h4>
        <h4>可配性： 多变的需求，代码一次搞定，通过后台配置搞定，而不是写代码 </h4>
        <h4>自解释： 重要的数据库信息，要求不依赖上下文就能单行自解释！历史数据不要用引用！</h4>


    </div>

</div>
