frontend/controllers/CategoryController.php

    public function beforeAction($action)
    {
        if(\Yii::$app->user->isGuest){
            return $this->redirect(\Yii::$app->user->loginUrl);
        }
        $user = User::findOne(\Yii::$app->user->identity->id);
---
SELECT * FROM `et_user` WHERE `id`='291'

    public function actionService($id, $order_number = 0)
    {
        $category = Category::findOne($id);
---
SELECT * FROM `et_category` WHERE `cateid`='45'

    public function actionPreServiceAnswer($courseware_id)
    {
        $courseware = Courseware::findOne($courseware_id);
        //课件的问题列表
        $questions = Question::find()->where(['courseware_id'=>$courseware_id])->all();
---
SELECT * FROM `et_courseware` WHERE `id`='17'
SELECT * FROM `et_question` WHERE `courseware_id`='17'

    public function actionSaveServiceAnswer(){
        $p = Yii::$app->request->post();
        $courseware_id = $p['courseware_id'];
        $answer_ids = isset($p['answer_ids'])?$p['answer_ids']:[];
        $courseware = Courseware::findOne($courseware_id);
        $order_number = $courseware->order_number;
        $classify_id = $courseware->classify_id;
        $category = Category::findOne($classify_id);
        $answer_options = isset($p['answer_options'])?$p['answer_options']:[];
        $questions = Question::find()->where(['courseware_id'=>$courseware_id])->all();
        $studylog = Studylog::findOne(['student_id'=>\Yii::$app->user->identity->id,'courseware_id'=>$courseware_id,'classify_id' => $courseware->classify_id]);
        $errorNum = 0;

        foreach ($answer_ids as $key=>$id){
            $question = $questions[$key];
            $answer_option = $this->pAnswer(isset($answer_options[$key])?$answer_options[$key]:null);
            $is_correct = $question->correct_options==$answer_option;
//            $is_correct = $question->correct_options==$answer_option?1:0;
            $errorNum += !$is_correct;
            Answerlog::saveLog(Yii::$app->user->identity->id, Yii::$app->user->identity->username, $question->id, $answer_option, $is_correct, $classify_id);
        }
        // 考试不通过
        if($errorNum > 0){
            $studylog->status = 2;
            $studylog->save(false);
            // 保存学习状态为：不通过
            User::findOne(\Yii::$app->user->identity->id)->saveStudyStatus(3);
---
SELECT * FROM `et_courseware` WHERE `id`='28'
SELECT * FROM `et_category` WHERE `cateid`=45
SELECT * FROM `et_question` WHERE `courseware_id`='28'
SELECT * FROM `et_studylog` WHERE (`student_id`='291') AND (`courseware_id`='28') AND (`classify_id`=45)
UPDATE `et_studylog` SET `status`=2 WHERE `id`='10'
SELECT * FROM `et_user` WHERE `id`='291'

    public function actionExampass($id=0){
        $courseware = Courseware::findOne($id);
        $category = Category::findOne($courseware->classify_id);
---
SELECT * FROM `et_courseware` WHERE `id`='28'
SELECT * FROM `et_category` WHERE `cateid`=45