src/common/models/AdminUser.php

SELECT * FROM `et_adminuser` WHERE (`id`=1) AND (`status`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);