src/common/models/User.php

SELECT * FROM `et_user` WHERE `id`=291
---
    public static function findById($id) {
        $user = self::find()->where(array('id' => $id))->asArray()->one();