frontend/models/Answerlog.php

SELECT * FROM `et_answerlog` WHERE (`classify_id` = 45) AND (`answerer_id` = '291') AND (`question_id` = '42')
---
    public static function saveLog($uid, $uname, $qid, $answer_option, $correct_options, $classify_id){
        $where = ['and', ['=', 'classify_id', $classify_id], ['=', 'answerer_id', $uid], ['=', 'question_id', $qid]];
        $model = Answerlog::find()->where($where)->one();