frontend/models/Studylog.php

    public static function saveLog($uid, $vid, $status = 1, $classify_id = 1){
        $studyLog = Studylog::find()->where(['and',['=', 'student_id', $uid],['=', 'courseware_id', $vid]])->one();
        if(empty($studyLog)){
            $studyLog = new Studylog();
            $studyLog->student_id = $uid;
            $studyLog->courseware_id = $vid;
        }
        $studyLog->start_time = time();
        $studyLog->status = $status;
        $studyLog->classify_id = $classify_id;
        return $studyLog->save(false);
---
SELECT * FROM `et_studylog` WHERE (`student_id` = '291') AND (`courseware_id` = '28')
INSERT INTO `et_studylog` (`student_id`, `courseware_id`, `start_time`, `status`, `classify_id`) VALUES (291, 28, 1440743195, 1, 45)